app/Controllers/Akun.php

    public function profil()
    {
        $id_akun = session()->get('id_akun');
        if (!$id_akun) return redirect()->to('login');

        $model = new AkunModel();
        $data['akun']  = $model->find($id_akun);
---
SELECT *
FROM `akun`
WHERE `akun`.`id_akun` = '1'