app/Controllers/Auth.php

SELECT *
FROM `akun`
WHERE   (
`username` = 'satriadarzkine@gmail.com'
OR `email` = 'satriadarzkine@gmail.com'
 )
 LIMIT 1
---
    public function doLogin()
    {
        $model = new AkunModel();
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $user = $model->groupStart()
                      ->where('username', $username)
                      ->orWhere('email', $username)
                      ->groupEnd()
                      ->first();