app/Controllers/Dashboard.php

SELECT *
FROM `turnamen`
---
    public function index()
    {
        $turnamenModel = new TurnamenModel();
        $timModel = new TimModel();
        $jadwalModel = new JadwalModel();

        $data = [
            'title' => 'Dashboard',
            'total_turnamen' => count($turnamenModel->findAll()),
            'total_tim' => count($timModel->findAll()),
            'jadwal_hari_ini' => count($jadwalModel->getJadwalHariIni())
        ];

SELECT *
FROM `tim`
WHERE `id_akun` = '1'
 LIMIT 1
---
            $id_akun = session()->get('id_akun');

            // Layer 1: cek apakah kapten tim
            $tim = $timModel->where('id_akun', $id_akun)->first();