app/Controllers/GameController.php

    public function index()
    {
        $data = [
            'title' => 'Master Game',
            'games' => $this->gameModel->findAll()
---
SELECT *
FROM `game`