app/Controllers/PembayaranController.php

SELECT *
FROM `daftar`
WHERE `daftar`.`id_daftar` = '2'
SELECT `turnamen`.*, `game`.`nama_game`
FROM `turnamen`
LEFT JOIN `game` ON `game`.`id_game` = `turnamen`.`id_game`
WHERE `turnamen`.`id_turnamen` = '3'
---
    public function formUpload($id_daftar)
    {

        $model = new DaftarModel();
        $id_tim = session()->get('id_tim');

        $daftar = $model->find($id_daftar);

        if (!$daftar || $daftar['id_tim'] != $id_tim) {
            return redirect()->to('pembayaran/saya')->with('error', 'Data pendaftaran tidak ditemukan atau tidak berhak mengakses.');
        }

        // Cek jika sudah lunas tidak perlu upload
        if ($daftar['status_pembayaran'] === 'Lunas') {
            return redirect()->to('pembayaran/saya')->with('info', 'Pendaftaran ini sudah lunas.');
        }

        $turnamenModel = new TurnamenModel();
        $data['turnamen'] = $turnamenModel->select('turnamen.*, game.nama_game')
                                          ->join('game', 'game.id_game = turnamen.id_game', 'left')
                                          ->find($daftar['id_turnamen']);