app/Controllers/Tim.php

SELECT *
FROM `akun`
WHERE `peran` = 'Peserta'
---

            // Daftar peserta yang belum terhubung ke anggota manapun
            if ($data['is_kapten']) {
                $semuaPeserta = $akunModel->where('peran', 'Peserta')->findAll();