app/Controllers/Turnamen.php

    public function peserta()
    {

        $model = new TurnamenModel();
        $daftarModel = new DaftarModel();
        $id_tim = session()->get('id_tim');

        $data['turnamen'] = $model->select('turnamen.*, game.nama_game as game')
                                  ->join('game', 'game.id_game = turnamen.id_game', 'left')
                                  ->where('status !=', 'Selesai')
                                  ->findAll();
        $data['title'] = 'Turnamen Tersedia';
        $data['pendaftaran_saya'] = [];
        if ($id_tim) {
            $pendaftaran = $daftarModel->where('id_tim', $id_tim)->findAll();
---
SELECT `turnamen`.*, `game`.`nama_game` as `game`
FROM `turnamen`
LEFT JOIN `game` ON `game`.`id_game` = `turnamen`.`id_game`
WHERE `status` != 'Selesai'
SELECT *
FROM `daftar`
WHERE `id_tim` = '1'

    public function daftarTersedia()
    {

        $model       = new TurnamenModel();
        $daftarModel = new DaftarModel();
        $timModel    = new TimModel();
        $id_akun     = session()->get('id_akun');
        $id_tim      = session()->get('id_tim');

        // Tentukan apakah user ini kapten tim
        $is_kapten = false;
        if ($id_tim) {
            $tim = $timModel->find($id_tim);
            $is_kapten = $tim && ($tim['id_akun'] == $id_akun);
        }

        // Semua peserta (kapten maupun anggota) bisa melihat daftar
        $data['turnamen'] = $model->select('turnamen.*, game.nama_game as game')
                                  ->join('game', 'game.id_game = turnamen.id_game', 'left')
                                  ->where('status', 'Pendaftaran')
                                  ->findAll();

        $data['title']     = 'Daftar Turnamen Tersedia';
        $data['is_kapten'] = $is_kapten;

        // Ambil status pendaftaran tim (hanya relevan untuk kapten)
        $data['pendaftaran_saya'] = [];
        if ($id_tim) {
            $pendaftaran = $daftarModel->where('id_tim', $id_tim)->findAll();
---
SELECT *
FROM `tim`
WHERE `tim`.`id_tim` = '1'
SELECT `turnamen`.*, `game`.`nama_game` as `game`
FROM `turnamen`
LEFT JOIN `game` ON `game`.`id_game` = `turnamen`.`id_game`
WHERE `status` = 'Pendaftaran'
SELECT *
FROM `daftar`
WHERE `id_tim` = '1'

    public function daftarTurnamen($id_turnamen)
    {

        $id_akun  = session()->get('id_akun');
        $id_tim   = session()->get('id_tim');
        $timModel = new TimModel();

        if (!$id_tim) {
            return redirect()->to('tim/profil')->with('error', 'Anda harus memiliki tim untuk mendaftar turnamen.');
        }

        // Hanya kapten yang boleh mendaftarkan tim
        $tim = $timModel->find($id_tim);
        if (!$tim || $tim['id_akun'] != $id_akun) {
            return redirect()->to('turnamen/daftar-tersedia')
                             ->with('error', 'Hanya kapten tim yang dapat mendaftarkan tim ke turnamen. Hubungi kapten Anda.');
        }

        $model = new DaftarModel();

        // Cek apakah turnamen valid dan statusnya masih 'Pendaftaran'
        $turnamenModel = new TurnamenModel();
        $turnamen = $turnamenModel->find($id_turnamen);
        if (!$turnamen || $turnamen['status'] !== 'Pendaftaran') {
            return redirect()->to('turnamen/daftar-tersedia')->with('error', 'Turnamen tidak tersedia untuk didaftar.');
        }

        // Cek apakah sudah mendaftar
        $existing = $model->where(['id_turnamen' => $id_turnamen, 'id_tim' => $id_tim])->first();
---
SELECT *
FROM `tim`
WHERE `tim`.`id_tim` = '1'
SELECT *
FROM `daftar`
WHERE `id_turnamen` = '3'
AND `id_tim` = '1'
 LIMIT 1
SELECT *
FROM `turnamen`
WHERE `turnamen`.`id_turnamen` = '3'