app/Controllers/Turnamen.php

    public function daftarTersedia()
    {
        $this->checkRole('Peserta');

        $model       = new TurnamenModel();
        $daftarModel = new DaftarModel();
        $timModel    = new TimModel();
        $id_akun     = session()->get('id_akun');
        $id_tim      = session()->get('id_tim');

        // Tentukan apakah user ini kapten tim
        $is_kapten = false;
        if ($id_tim) {
            $tim = $timModel->find($id_tim);
            $is_kapten = $tim && ($tim['id_akun'] == $id_akun);
        }

        // Semua peserta (kapten maupun anggota) bisa melihat daftar
        $data['turnamen'] = $model->select('turnamen.*, game.nama_game as game')
                                  ->join('game', 'game.id_game = turnamen.id_game', 'left')
                                  ->where('status', 'Pendaftaran')
                                  ->findAll();

        $data['title']     = 'Daftar Turnamen Tersedia';
        $data['is_kapten'] = $is_kapten;

        // Ambil status pendaftaran tim (hanya relevan untuk kapten)
        $data['pendaftaran_saya'] = [];
        if ($id_tim) {
            $pendaftaran = $daftarModel->where('id_tim', $id_tim)->findAll();
---
SELECT `turnamen`.*, `game`.`nama_game` as `game`
FROM `turnamen`
LEFT JOIN `game` ON `game`.`id_game` = `turnamen`.`id_game`
WHERE `status` = 'Pendaftaran'
SELECT *
FROM `daftar`
WHERE `id_tim` = '1'