app/Models/AnggotaModel.php

    public function getAnggotaByTim($id_tim)
    {
        return $this->where('id_tim', $id_tim)->findAll();
---
SELECT *
FROM `anggota`
WHERE `id_tim` = '1'