app/Models/DaftarModel.php

SELECT `daftar`.*, `turnamen`.`nama_turnamen`, `turnamen`.`tanggal_mulai`, `turnamen`.`status`, `turnamen`.`biaya_pendaftaran`, `game`.`nama_game`
FROM `daftar`
JOIN `turnamen` ON `turnamen`.`id_turnamen` = `daftar`.`id_turnamen`
LEFT JOIN `game` ON `game`.`id_game` = `turnamen`.`id_game`
WHERE `daftar`.`id_tim` = '1'
---
    public function getPendaftaranByTim($id_tim)
    {
        return $this->select('daftar.*, turnamen.nama_turnamen, turnamen.tanggal_mulai, turnamen.status, turnamen.biaya_pendaftaran, game.nama_game')
                    ->join('turnamen', 'turnamen.id_turnamen = daftar.id_turnamen')
                    ->join('game', 'game.id_game = turnamen.id_game', 'left')
                    ->where('daftar.id_tim', $id_tim)
                    ->findAll();